---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartLevelReference
source: html/484939bf-f377-9987-8ceb-fa9c2e707f93.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartLevelReference Property

"Start Attachment Level Reference"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentStartLevelReference { get; }
```